2016/brp 2016-02-09/art/art-framework/funqmachine/src/test/resources/nl/bzk/brp/funqmachine/processors/db-ber-result.xml

<Results>
    <ResultSet fetchsize="0">
        <Row rowNumber="1">
            <DATA>
                Uitgaand Bericht
                --------------------------------------
                Adres: http://192.168.212.114:12000/ontvanger
                Encoding: UTF-8
                Http-Method: POST
                Content-Type: text/xml
                Headers: {Accept=[*/*], SOAPAction=[""]}
                Payload: <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
                <soap:Body>
                    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
                        <brp:stuurgegevens>
                            <brp:zendendePartij>199903</brp:zendendePartij>
                            <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
                            <brp:ontvangendePartij>034401</brp:ontvangendePartij>
                            <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
                            <brp:referentienummer>282013f6-905d-46ef-91d5-7689e7c4a95d</brp:referentienummer>
                            <brp:tijdstipVerzending>2015-02-18T08:41:21.388+01:00</brp:tijdstipVerzending>
                        </brp:stuurgegevens>
                        <brp:parameters>
                            <brp:soortSynchronisatie>Volledigbericht</brp:soortSynchronisatie>
                            <brp:abonnementNaam>Geen pop.bep. levering op basis van doelbinding</brp:abonnementNaam>
                            <brp:categorieDienst>Synchronisatie persoon</brp:categorieDienst>
                        </brp:parameters>
                        <brp:synchronisatie brp:objecttype="AdministratieveHandeling">
                            <brp:code>31006</brp:code>
                            <brp:naam>Synchronisatie persoon</brp:naam>
                            <brp:categorie>Synchronisatie</brp:categorie>
                            <brp:partijCode>034401</brp:partijCode>
                            <brp:tijdstipRegistratie>2015-02-18T08:41:21.228+01:00</brp:tijdstipRegistratie>
                            <brp:bijgehoudenPersonen>
                                <brp:persoon brp:objecttype="Persoon" brp:communicatieID="1">
                                    <brp:soortCode>I</brp:soortCode>
                                </brp:persoon>
                            </brp:bijgehoudenPersonen>
                        </brp:synchronisatie>
                    </brp:lvg_synVerwerkPersoon>
                </soap:Body>
            </soap:Envelope>

                --------------------------------------
            </DATA>
        </Row>
    </ResultSet>
</Results>
